app/controllers/categories_controller.rb

SELECT * FROM `categories` WHERE (`categories`.`id` = 3)
---
  def thumbnail
    @category = Category.find(params[:id])