app/controllers/choices_controller.rb

SELECT * FROM `choices` WHERE (`choices`.`id` = 134)
---
  def thumbnail
    @choice = Choice.find(params[:id])

SELECT * FROM `choices` WHERE (`choices`.`id` = 123)
---
  def thumbnail_150
    @choice = Choice.find(params[:id])

SELECT * FROM `choices` WHERE (`choices`.`id` = 134)
---
  def set_feature
    choice = Choice.find(params[:id])

INSERT INTO `product_filters` (`updated_at`, `type`, `product_id`, `operator`, `choice_id`, `recommendation`, `feature_id`, `descriptor`, `created_at`) VALUES('2009-05-06 19:57:44', 'ProductFilterSimple', 23, 'or', NULL, 1, NULL, NULL, '2009-05-06 19:57:44')
SELECT * FROM `products` WHERE (`products`.`id` = 23)
---
  def add_filter
    choice = Choice.find(params[:id])
    recommendation = Integer(params[:recommendation])
    product_filter_feature =  case params[:type_filter]
        when "product" then ProductFilter::ProductFilterSimple.create_from_product(Product.find(params[:product_id]), recommendation)