app/controllers/products_controller.rb

SELECT * FROM `products` WHERE (`products`.`id` = 24)
---
  def show
    @product = Product.find(params[:id].to_i)

SELECT * FROM `products` WHERE (`products`.`id` = 23)
---
  def thumbnail
    @product = Product.find(params[:id])

SELECT * FROM `products` WHERE (`products`.`id` = 60)
---
  def thumbnail_150
    @product = Product.find(params[:id])

SELECT * FROM `products` WHERE (`products`.`id` = 24)
---
  def thumbnail_120
    @product = Product.find(params[:id])