app/controllers/questions_controller.rb

SELECT * FROM `categories` WHERE (`categories`.`id` = 5)
SELECT * FROM `questions` WHERE (questions.category_id=5) ORDER BY created_at DESC
SELECT `choices`.* FROM `choices` WHERE (`choices`.question_id IN (51,50,49,48,47,44,42,41,40,39,38,36,33,32,30,29,27,26,22,21,20,18,17,13,7,1))
---
  def index
    if !params[:product_id].blank?
      @product = Product.find(params[:product_id])
      @filter_questions = "Product #{@product.label}"
      @category = @product.category
      @questions = Question.find(:all, :include => {:choices => :tips}, :order => "created_at DESC",
          :conditions => ["tips.product_id=?", @product.id])

SELECT * FROM `questions` WHERE (`questions`.`id` = 40)
---
  def edit
    @question = Question.find(params[:id])